'use strict';
/***********************************************************************
 * 描述：Http状态常量类<br>
 * -----------------------------------------------------------------<br>
 * 变更序号：<br>
 * 修改日期：<br>
 * 修改人员：<br>
 * 修改原因：<br>
 * **********************************************************************
 */

var HttpStatus = {
	CONTINUE: {
		code: 100,
		msg: '客户端应当继续发送请求'
	},
	SWITCHING_PROTOCOLS: {
		code: 101,
		msg: '服务器已经理解了客户端的请求'
	},
	PROCESSING: {
		code: 102,
		msg: '扩展的状态码,代表处理将被继续执行'
	},
	OK: {
		code: 200,
		msg: '请求已成功,请求所希望的响应头或数据体将随此响应返回'
	},
	CREATED: {
		code: 201,
		msg: '请求已经被实现,而且有一个新的资源已经依据请求的需要而建立'
	},
	ACCEPTED: {
		code: 202,
		msg: '服务器已接受请求,但尚未处理'
	},
	NON_AUTHORITATIVE_INFORMATION: {
		code: 203,
		msg: '服务器已成功处理了请求,但返回的实体头部元信息不是在原始服务器上有效的确定集合,而是来自本地或者第三方的拷贝'
	},
	NO_CONTENT: {
		code: 204,
		msg: '服务器成功处理了请求,但不需要返回任何实体内容,并且希望返回更新了的元信息'
	},
	RESET_CONTENT: {
		code: 205,
		msg: '服务器成功处理了请求,且没有返回任何内容'
	},
	PARTIAL_CONTENT: {
		code: 206,
		msg: '服务器已经成功处理了部分 GET请求'
	},
	MULTI_STATUS: {
		code: 207,
		msg: '扩展的状态码,代表之后的消息体将是一个XML消息'
	},
	MULTIPLE_CHOICES: {
		code: 300,
		msg: '被请求的资源有一系列可供选择的回馈信息,每个都有自己特定的地址和浏览器驱动的商议信息'
	},
	MOVED_PERMANENTLY: {
		code: 301,
		msg: '被请求的资源已永久移动到新位置,并且将来任何对此资源的引用都应该使用本响应返回的若干个 URI 之一'
	}
};