'use strict';
/***********************************************************************
 * 描述：消息常量类<br>
 * -----------------------------------------------------------------<br>
 * 变更序号：<br>
 * 修改日期：<br>
 * 修改人员：<br>
 * 修改原因：<br>
 * **********************************************************************
 */

var HttpMessage = {
	DB_ERROR: {
		code: '001',
		msg: '数据库错误'
	},
	NOT_FOUND_DATA: {
		code: '100',
		msg: '未找到指定数据'
	},
	NOT_UNIQUE_RECORD: {
		code: '101',
		msg: '记录不唯一'
	},
	RESPONSE_OK: {
		code: 200,
		msg: '请求成功'
	},
	REQUEST_TIMEOUT: {
		code: 408,
		msg: '请求超时'
	}
};